This seems to work for me:

```
resource "vault_mount" "kvv2" {
  path        = "kv"
  type        = "kv"
  description = "Key/Value V2 - with versioning"

  options = {
    version = 2
    max_versions = 3
    cas_enabled = false
  }
}
```

```
$ terraform apply
# vault_mount.kvv2 will be created
  + resource "vault_mount" "kvv2" {
      + accessor                  = (known after apply)
      + default_lease_ttl_seconds = (known after apply)
      + description               = "Key/Value V2 - with versioning"
      + id                        = (known after apply)
      + max_lease_ttl_seconds     = (known after apply)
      + options                   = {
          + "cas_enabled"  = "false"
          + "max_versions" = "3"
          + "version"      = "2"
        }
      + path                      = "kv"
      + type                      = "kv"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vault_mount.kvv2: Creating...
vault_mount.kvv2: Creation complete after 0s [id=kv]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

```
$ vault read -format=json kv/config
{
  "request_id": "f762a8b2-b871-e3a1-9bc1-d0b79d25eb52",
  "lease_id": "",
  "lease_duration": 0,
  "renewable": false,
  "data": {
    "cas_required": false,
    "max_versions": 0
  },
  "warnings": null
}
```

```
$ terraform version
Terraform v0.12.6
+ provider.vault v2.2.0
```